// ВКМ Начало доработки
#Область ОбработкаИсходящийСообщений
Функция ВКМ_ОтправкаСообщенийВТелеграмм(ТектСообщения) Экспорт
	
	Токен = Константы.ВКМ_ТокенУправленияяТелеграмБота.Получить();
	Адресат = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	АдресURL = СтрШаблон("https://api.telegram.org/bot%1/sendMessage", Токен);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("chat_id", Формат(Адресат, "ЧГ=0"));
	ПараметрыЗапроса.Вставить("text", ТектСообщения);
	
	РезультатОтправки = Неопределено;
	
	Попытка
		РезультатОтправки = ВКМ_КоннекторHTTP.GetJson(АдресURL, ПараметрыЗапроса);  
	Исключение
		ВКМ_ЗаписьОбОшибкиВЖурналРегистрации();
	КонецПопытки;
	
	СообщениеОтправлено = РезультатОтправки["ok"];
	
	Если СообщениеОтправлено Тогда
        Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ВКМ_ОтправкаСообщенийСправочника() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ВКМ_ОтправкаСообщенийВТелеграмм(Выборка.ТекстСообщения) Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ВКМ_ЗаписьОбОшибкиВЖурналРегистрации()
	
	СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий,ДатаСобытия");
	СтруктураСобытий.ИмяСобытия = "Отправка сообщения в Телеграмм";
	СтруктураСобытий.ПредставлениеУровня = "Ошибка";
	СтруктураСобытий.Комментарий = "Сообщение не отправлено";
	СобытияДляЖурналаРегистрации = Новый СписокЗначений();
	СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
	
КонецПроцедуры
#КонецОбласти 
// ВКМ Конец докработки
