
&НаСервере
Функция СоздатьДокументыНаСервере(ВыполняемаяКоманда, УникальныйИдентификатор)
	
	ПараметрыВыполненияОбработки = Новый Структура();
	ПараметрыВыполненияОбработки.Вставить("Период", Объект.Период);
    ПараметрыВыполненияОбработки.Вставить("ТекущаяДата", ТекущаяДата());
	
	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ИмяОбработки = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	   
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("БезопасныйРежим", Ложь);
	ПараметрыЗадания.Вставить("ИмяОбработки", "ВКМ_МассовоеСозданиеАктов");
	ПараметрыЗадания.Вставить("ИмяМетода", ВыполняемаяКоманда.Идентификатор);
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", ПараметрыВыполненияОбработки);
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Ложь);
	ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка", Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Имя фонового задания'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
		
КонецФункции 

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Сообщить("Не указан период");
		Возврат;
	КонецЕсли; 
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПослеЗавершенияДлительнойОперации", ЭтотОбъект, Неопределено); 
	
	ВыполняемаяКоманда = Новый Структура("Идентификатор", "СоздатьДокументыРеализацияВФоне" );
	
	ДлительнаяОперация = СоздатьДокументыНаСервере(ВыполняемаяКоманда, УникальныйИдентификатор);
	ИдентификаторФоновогоЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработчикЗавершения); 

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияДлительнойОперации(Операция, ДополнительныеПараметры) Экспорт  
	
	Если Операция.Статус = "Выполнено" Тогда
		ОбработатьРезультатВыполнения(Операция.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыполнения(АдресРезультата)   
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Объект.ТаблицаДанных.Очистить();
	Объект.ТаблицаДанных.Загрузить(Результат);

	УдалитьИзВременногоХранилища(АдресРезультата);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.Период = НачалоМесяца(Объект.Период);
КонецПроцедуры
