
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	ВКМ_ПечатьАкта(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();

КонецПроцедуры

// ВКМ Начало доработки
&НаСервере
Процедура ВКМ_ПечатьАкта(ТабДок, ПараметрКоманды)
	Документы.РеализацияТоваровУслуг.ВКМ_ПечатьАкта(ТабДок, ПараметрКоманды);
КонецПроцедуры
// ВКМ Конец докработки