
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ВКМ Начало доработки
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Для Каждого ТекСтрока Из СписокСотрудников Цикл
		ДвижениеПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеПремия.Сторно = Ложь;
		ДвижениеПремия.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_Премия;
		ДвижениеПремия.ПериодРегистрации = ПериодРегистрации;
		ДвижениеПремия.ВКМ_Сотрудник = ТекСтрока.Сотрудник;
		ДвижениеПремия.ВКМ_Результат = ТекСтрока.СуммаПремии;
	
		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.Сторно = Ложь;
		ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
		ДвижениеНДФЛ.ПериодРегистрации = ПериодРегистрации;
		ДвижениеНДФЛ.ВКМ_Сотрудник = ТекСтрока.Сотрудник; 
		СуммаНДФЛ = ТекСтрока.СуммаПремии / 100 * 13; 
		ДвижениеНДФЛ.ВКМ_Результат = - СуммаНДФЛ;
	КонецЦикла;
	
	ВКМ_СформироватьДвиженияВзаиморасчетов();
	// ВКМ Конец докработки
	
КонецПроцедуры

// ВКМ Начало доработки
Процедура ВКМ_СформироватьДвиженияВзаиморасчетов() 
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.ВКМ_Сотрудник КАК Сотрудник,
	|	ВКМ_ДополнительныеНачисления.ВКМ_Результат КАК Сумма
	|ПОМЕСТИТЬ ДанныеРегистра
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_Удержания.ВКМ_Сотрудник,
	|	ВКМ_Удержания.ВКМ_Результат
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРегистра.Сотрудник КАК Сотрудник,
	|	СУММА(ДанныеРегистра.Сумма) КАК Сумма
	|ИЗ
	|	ДанныеРегистра КАК ДанныеРегистра
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	  Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	  Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	  Движение.Период = ПериодРегистрации;
	  Движение.Сотрудник = Выборка.Сотрудник;
	  Движение.Сумма = Выборка.Сумма;
      Движение.Регистратор = Ссылка;
	КонецЦикла;

КонецПроцедуры
// ВКМ Конец докработки