
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ВКМ Начало доработки
	ВКМ_ЗаполнитьГрафикОтпусков();
	// ВКМ Конец докработки
КонецПроцедуры

&НаСервере
Процедура ВКМ_ЗаполнитьГрафикОтпусков()
	
	// ВКМ Начало доработки
	ТаблицаДанных = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);

	Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;	
	КонецЦикла;
    // ВКМ Конец докработки
	
КонецПроцедуры
