&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ВКМ Начало доработки
	ВКМ_СозданиеЭлеменовФормы();
	ВКМ_ВидимостьЭлементовФормы();
	// ВКМ Конец докработки
	
КонецПроцедуры

// ВКМ Начало доработки
&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	
	ВКМ_ВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_ВидимостьЭлементовФормы()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_АбонементОбслуживание.Видимость = Истина;
	Иначе
		Элементы.ВКМ_АбонементОбслуживание.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_СозданиеЭлеменовФормы()

	НоваяГруппа = Элементы.Добавить("ВКМ_АбонементОбслуживание", Тип("ГруппаФормы"), ЭтаФорма);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = ЛОЖЬ; 
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ВКМ_ДатаНачалаДействияДоговора = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"),НоваяГруппа);
	ВКМ_ДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ВКМ_ДатаОкончанияДействияДоговора = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"),НоваяГруппа);
	ВКМ_ДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	
	ВКМ_СуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"),НоваяГруппа);
	ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ВКМ_СтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"),НоваяГруппа);
	ВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры
// ВКМ Конец докработки


